{
  "companies": [
    {
      "name": "The Tarzan Way",
      "role": "Full-stack Developer",
      "startDate": "Jan 2024",
      "endDate": "Present",
      "location": "Noida, Uttar Pradesh, India",
      "description": [
        "As a Full Stack Developer specializing in Django, DRF, and Postgres, with a focus on backend functionalities and data migration.",
        "Demonstrated expertise in optimizing APIs, reducing database queries by 60%, improving API response time by over 50%, and implementing Dynamic Serializers to streamline payload and round-trip time.",
        "Successfully managed multiple projects, overseeing data synchronization, creating database population scripts, and integrating 3rd party APIs, including GPT APIs.",
        "Implemented enhancements and resolved issues within the frontend project, introducing user-centric features aimed at facilitating streamlined data manipulation for enhanced usability.",
        "Proficiently deployed updates without any downtime, ensuring continuous availability for users.",
        "Employed AWS services, notably S3 integrated with Cloud Front and Lambda functions, to deploy the frontend project, thereby optimizing loading times and mitigating latency issues."
      ]
    },
    {
      "name": "MediBuddy",
      "role": "SDE Intern",
      "startDate": "Jan 2023",
      "endDate": "May 2023",
      "location": "Bangalore, India",
      "description": [
        "Interned as an SDE at Medibuddy, contributing to the development of a platform enabling external vendors to sell products directly to Medibuddy’s large customer base. The platform was architected following a microservices approach.",
        "Employed event logging to handle user interactions and gather data on user behavior.",
        "Developed and managed vendor onboarding processes, allowing vendors to list products with comprehensive details, including pricing and inventory.",
        "Utilized Postgres as the primary database and integrated Redis for caching to enhance data retrievalspeed and reduce latency.",
        "Incorporated new APIs into an ongoing project to enhance existing features and functionality."
      ]
    },
    {
      "name": "NamaSYS",
      "role": "Python Developer Intern",
      "startDate": "Jan 2022",
      "endDate": "Mar 2022",
      "location": "New Delhi, India",
      "description": [
        "Developed efficient programs to automate tasks involving scraping data etc.",
        "Successfully debugged and resolved code issues related to data storage in the database, ensuring accurate data management.",
        "Worked with different APIs and SQL databases to retrieve and store data for data analysis.",
        "Implemented an end-to-end solution on Microsoft Azure, involving the creation of virtual machines and Developed a automation script to retrieve data from APIs and securely store it in Azure Blob Storage."
      ]
    }
  ]
}
